app/controllers/entries_controller.rb

  def create
    @entry = current_user.entries.build(entries_params)
    @entry.measurement_ids = params[:measurement_ids]
    if @entry.save
---
INSERT INTO "entries" ("user_id", "content", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["content", "test content"], ["time", "2013-09-19"], ["created_at", "2018-08-31 11:12:50.029585"], ["updated_at", "2018-08-31 11:12:50.029585"]]

  def update
    if @entry.update(entries_params)
---
UPDATE "entries" SET "content" = $1, "updated_at" = $2 WHERE "entries"."id" = $3  [["content", "trash sesh"], ["updated_at", "2018-09-06 17:59:43.643846"], ["id", 5]]

  def destroy
    @entry.destroy
---
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 3]]

    def set_entry
      @entry = current_user.entries.find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."user_id" = $1 AND "entries"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 5], ["LIMIT", 1]]