app/controllers/measurements_controller.rb

INSERT INTO "measurements" ("user_id", "measurement_category_id", "entry_id", "string_value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["measurement_category_id", 2], ["entry_id", 2], ["string_value", "123213"], ["created_at", "2018-09-10 06:55:21.555531"], ["updated_at", "2018-09-10 06:55:21.555531"]]
---
  def create
    @measurement = Measurement.new(measurement_params)
    @measurement.user_id = current_user.id

    respond_to do |format|
      if @measurement.save

SELECT  "measurements".* FROM "measurements" WHERE "measurements"."id" = $1 LIMIT $2  [["id", 183], ["LIMIT", 1]]
UPDATE "measurements" SET "string_value" = $1, "updated_at" = $2 WHERE "measurements"."id" = $3  [["string_value", "123"], ["updated_at", "2018-09-11 09:50:23.561185"], ["id", 249]]
---
  def update
    @measurement = Measurement.find(params[:id])

    respond_to do |format|
      if @measurement.update(measurement_params)

SELECT  "measurements".* FROM "measurements" WHERE "measurements"."id" = $1 LIMIT $2  [["id", 161], ["LIMIT", 1]]
DELETE FROM "measurements" WHERE "measurements"."id" = $1  [["id", 161]]
---
  def destroy
    @measurement = Measurement.find(params[:id])
    @measurement.destroy