app/controllers/measurment_categories_controller.rb

SELECT "measurment_categories".* FROM "measurment_categories"
---
    def index
      @measurment_categories = MeasurmentCategory.all

INSERT INTO "measurment_categories" ("user_id", "title", "measurment_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["title", "test"], ["measurment_type", 0], ["created_at", "2018-09-04 12:49:21.224759"], ["updated_at", "2018-09-04 12:49:21.224759"]]
---
    def create
      @measurment_category = current_user.measurment_categories.build(measurment_categories_params)

      if @measurment_category.save